01  WS-AREA-1 PIC X(10). 
01  WS-AREA-2 PIC 9(5). 

PROCEDURE DIVISION. 
    MOVE '1234567890' TO WS-AREA-1
    MOVE WS-AREA-1 TO WS-AREA-2
    DISPLAY WS-AREA-2
    STOP RUN.