01  WS-AREA-1 PIC X(10). 
01  WS-AREA-2 PIC 9(5). 
01  WS-AREA-3 PIC 9(5) VALUE 0. 

PROCEDURE DIVISION. 
    MOVE '1234567890' TO WS-AREA-1
    IF WS-AREA-1 NUMERIC THEN
       MOVE WS-AREA-1 TO WS-AREA-3
       DISPLAY WS-AREA-3
    ELSE
       DISPLAY "Invalid Numeric Data"
    END-IF
    STOP RUN.